app/controllers/school_classes_controller.rb

  def index
    @all_school_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

  def create
    new_school_class = SchoolClass.create( school_class_params( :title, :room_number ) )
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Potions"], ["room_number", 88], ["created_at", "2021-01-13 23:44:00.940021"], ["updated_at", "2021-01-13 23:44:00.940021"]]

  def show
    @this_school_class = SchoolClass.find( params[ :id ] )
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @this_school_class = SchoolClass.find( params[ :id ] )
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    updated_school_class = SchoolClass.find( params[ :id ] )
    updated_school_class.update( school_class_params( :title, :room_number ) )
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 87], ["updated_at", "2021-01-14 00:26:10.151493"], ["id", 1]]