app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Josh"], ["last_name", "Frank"], ["created_at", "2021-01-13 23:18:26.201294"], ["updated_at", "2021-01-13 23:18:26.201294"]]
---
  def create
    new_student = Student.create( student_params( :first_name, :last_name ) )

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @this_student = Student.find( params[ :id ] )

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @this_student = Student.find( params[ :id ] )

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Joshua"], ["updated_at", "2021-01-13 23:27:28.911365"], ["id", 1]]
---
  def update
    updated_student = Student.find( params[ :id ] )
    updated_student.update( student_params( :first_name, :last_name ) )